Loading Data in python

In [13]:
import pandas as pd
import pickle
import numpy as np

In [14]:
filename='load.csv'

In [23]:
cols = None
data = []
with open(filename) as f:
    for lines in f.readlines():
        vals = lines.replace('\n','').split(',')
        if cols is None:
            cols= vals
        else :
            data.append([float(x) for x in vals ])

d0= pd.DataFrame(data,columns =cols)
print(d0.dtypes)
d0.head()

A    float64
B    float64
C    float64
D    float64
E    float64
dtype: object

       A       B       C        D      E
0  1.276  21.400  63.957  216.204  528.0
1  1.002  21.950  61.697  204.484  514.0
2  1.114  22.454  63.522  205.608  514.0
3  1.133  22.494  61.590  206.565  501.0
4  0.845  21.654  63.729  201.289  532.0

In [26]:
d1= np.loadtxt(filename,skiprows = 1, delimiter = ',')
print(d1.dtype)
print(d1[:5,:])
# here in np.loadtxt its coming out as 2d array but not as a data frame

float64
[[  1.276  21.4    63.957 216.204 528.   ]
 [  1.002  21.95   61.697 204.484 514.   ]
 [  1.114  22.454  63.522 205.608 514.   ]
 [  1.133  22.494  61.59  206.565 501.   ]
 [  0.845  21.654  63.729 201.289 532.   ]]

In [28]:
d2=np.genfromtxt(filename,delimiter=',',names= True,dtype=None)
print(d2.dtype)
print(d2[:5,])
# Here the d2.dtype is the datatype of the column which is float 8 bit and last column is integer.As soon as we put names= True the entire loaded data becomes 1-D array thatswhy we try to print(d1[:5,:]) there is error msg.

[('A', '<f8'), ('B', '<f8'), ('C', '<f8'), ('D', '<f8'), ('E', '<i4')]
[(1.276, 21.4  , 63.957, 216.204, 528)
 (1.002, 21.95 , 61.697, 204.484, 514)
 (1.114, 22.454, 63.522, 205.608, 514)
 (1.133, 22.494, 61.59 , 206.565, 501)
 (0.845, 21.654, 63.729, 201.289, 532)]

In [37]:
d3= pd.read_csv(filename)
print(d2.dtype)
d3.head()

[('A', '<f8'), ('B', '<f8'), ('C', '<f8'), ('D', '<f8'), ('E', '<i4')]

       A       B       C        D    E
0  1.276  21.400  63.957  216.204  528
1  1.002  21.950  61.697  204.484  514
2  1.114  22.454  63.522  205.608  514
3  1.133  22.494  61.590  206.565  501
4  0.845  21.654  63.729  201.289  532

In [36]:
with open('load_pickle.pickle','rb') as f:
    d4 = pickle.load(f)
print(d4.dtypes)
d4.head()

A    float64
B    float64
C    float64
D    float64
E      int32
dtype: object

          A          B          C           D    E
0  1.276405  21.400157  63.957476  216.204466  528
1  1.002272  21.950088  61.697286  204.483906  514
2  1.114404  22.454274  63.522075  205.608375  514
3  1.133367  22.494079  61.589683  206.565339  501
4  0.844701  21.653619  63.728872  201.289175  532

In [ ]:
# So Moral of the story always use the pandas read_csv for loading the data.